//------------------------------------------------------------------------
// FUNCTION: is_prime
// Проверява дали дадено число е просто.
// PARAMETERS:
// -> цяло число
//------------------------------------------------------------------------
int is_prime(long number);

//------------------------------------------------------------------------
// FUNCTION: count_of_primes
// Брои простите числа от 1 до дадено число.
// PARAMETERS:
// -> цяло число
//------------------------------------------------------------------------
void *count_of_primes(void *number);